Languages/rust.org
#+TITLE: Rust Resources
#+INDEX: Rust Resources

* Learn Rust

** Links
- [[https://docs.microsoft.com/en-us/learn/modules/rust-get-started/1-introduction][Take your first steps with Rust]]
- [[https://levpaul.com/posts/rust-lesson-1/][Rust from a Gopher]]
- [[https://daveshawley.medium.com/my-journey-to-understand-rust-lang-28e4cf808b12][My journey to understand rust-lang]]
- [[https://blog.abor.dev/p/timclicks][Routes to Discovering Rust]]
- [[https://blog.logrocket.com/what-you-cant-do-in-rust-and-what-to-do-instead/][What you can't do in Rust and what to do instead]]
** Videos
- [[https://www.youtube.com/playlist?list=PLwtLEJr-BkXZ9PmoAlqaFdoj47o61TWrS][Learn Rust Programming]]

* Front End
- [[https://dev.to/fllstck/intro-to-yew-a-rust-frontend-framework-20hb][Intro to Yew, a Rust Frontend Framework]]
- [[https://seed-rs.org/][Seed RS]]
- [[https://blog.abor.dev/p/moonzoon][Rust on the Frontend]]
* Operating Systems
- [[https://dev.to/tangramvision/why-rust-for-robots-4nmd][Why Rust for Robots?]]

* OPS
- [[https://www.fluvio.io/blog/2021/04/github-actions-best-practices/][GitHub Actions best practices for Rust projects]]

* Language Development
 - [[https://arzg.github.io/lang/1/][Make a Language]]

* Web Assembly
- [[https://thenewstack.io/using-web-assembly-written-in-rust-on-the-server-side/][Using Web Assembly Written in Rust on the Server-Side]]
- [[https://dev.to/seanwatters/state-management-with-webassembly-rust-5a1g][State Management With WebASsembly and Rust]]

* Random
- [[https://brson.github.io/2021/05/02/rusts-most-unrecognized-contributor][Rust's Most Unrecognized Contributer]]
- [[https://engineering.fb.com/2021/04/29/developer-tools/rust/][A brief history of Rust at Facebook]]
- [[https://gregoryszorc.com/blog/2021/04/13/rust-is-for-professionals/][Rust is for Professionals]]

* GRPC
- [[https://dev.to/transienterror/setting-up-a-grpc-protobuf-server-with-tonic-218e][Setting Up a gRPC Protobuf Server with Tonic]]
- [[https://romankudryashov.com/blog/2021/04/grpc-rust/][Introduction to gRPC in Rust]]
- [[https://truelayer.com/blog/grpc-load-balancing-in-rust][gRPC load balancing in Rust]]
* Web App
 - [[https://dev.to/steadylearner/how-to-use-rust-warp-web-framework-2b4e][How to use Warp Framework]]
