docs/Languages/rust.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-07-01 Thu 18:06 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Rust Resources</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="/static/css/org.css">
</head>
<body>
<div id="preamble" class="status">
<a href="/">Home</a>
</div>
<div id="content">
<header>
<h1 class="title">Rust Resources</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc68ba93">1. Learn Rust</a>
<ul>
<li><a href="#org82247c7">1.1. Links</a></li>
<li><a href="#orgec13ed9">1.2. Videos</a></li>
</ul>
</li>
<li><a href="#orgee922a0">2. Front End</a></li>
<li><a href="#org9ba1b57">3. Operating Systems</a></li>
<li><a href="#orga6fc1f2">4. OPS</a></li>
<li><a href="#org39d0988">5. Language Development</a></li>
<li><a href="#orgadf0141">6. Web Assembly</a></li>
<li><a href="#org8540c28">7. Random</a></li>
<li><a href="#org2ea946e">8. GRPC</a></li>
<li><a href="#orgc88c51c">9. Web App</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgc68ba93" class="outline-2">
<h2 id="orgc68ba93"><span class="section-number-2">1</span> Learn Rust</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org82247c7" class="outline-3">
<h3 id="org82247c7"><span class="section-number-3">1.1</span> Links</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://docs.microsoft.com/en-us/learn/modules/rust-get-started/1-introduction">Take your first steps with Rust</a></li>
<li><a href="https://levpaul.com/posts/rust-lesson-1/">Rust from a Gopher</a></li>
<li><a href="https://daveshawley.medium.com/my-journey-to-understand-rust-lang-28e4cf808b12">My journey to understand rust-lang</a></li>
<li><a href="https://blog.abor.dev/p/timclicks">Routes to Discovering Rust</a></li>
<li><a href="https://blog.logrocket.com/what-you-cant-do-in-rust-and-what-to-do-instead/">What you can't do in Rust and what to do instead</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgec13ed9" class="outline-3">
<h3 id="orgec13ed9"><span class="section-number-3">1.2</span> Videos</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/playlist?list=PLwtLEJr-BkXZ9PmoAlqaFdoj47o61TWrS">Learn Rust Programming</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgee922a0" class="outline-2">
<h2 id="orgee922a0"><span class="section-number-2">2</span> Front End</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://dev.to/fllstck/intro-to-yew-a-rust-frontend-framework-20hb">Intro to Yew, a Rust Frontend Framework</a></li>
<li><a href="https://seed-rs.org/">Seed RS</a></li>
<li><a href="https://blog.abor.dev/p/moonzoon">Rust on the Frontend</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9ba1b57" class="outline-2">
<h2 id="org9ba1b57"><span class="section-number-2">3</span> Operating Systems</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://dev.to/tangramvision/why-rust-for-robots-4nmd">Why Rust for Robots?</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga6fc1f2" class="outline-2">
<h2 id="orga6fc1f2"><span class="section-number-2">4</span> OPS</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://www.fluvio.io/blog/2021/04/github-actions-best-practices/">GitHub Actions best practices for Rust projects</a></li>
</ul>
</div>
</div>

<div id="outline-container-org39d0988" class="outline-2">
<h2 id="org39d0988"><span class="section-number-2">5</span> Language Development</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://arzg.github.io/lang/1/">Make a Language</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgadf0141" class="outline-2">
<h2 id="orgadf0141"><span class="section-number-2">6</span> Web Assembly</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="https://thenewstack.io/using-web-assembly-written-in-rust-on-the-server-side/">Using Web Assembly Written in Rust on the Server-Side</a></li>
<li><a href="https://dev.to/seanwatters/state-management-with-webassembly-rust-5a1g">State Management With WebASsembly and Rust</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8540c28" class="outline-2">
<h2 id="org8540c28"><span class="section-number-2">7</span> Random</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://brson.github.io/2021/05/02/rusts-most-unrecognized-contributor">Rust's Most Unrecognized Contributer</a></li>
<li><a href="https://engineering.fb.com/2021/04/29/developer-tools/rust/">A brief history of Rust at Facebook</a></li>
<li><a href="https://gregoryszorc.com/blog/2021/04/13/rust-is-for-professionals/">Rust is for Professionals</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2ea946e" class="outline-2">
<h2 id="org2ea946e"><span class="section-number-2">8</span> GRPC</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://dev.to/transienterror/setting-up-a-grpc-protobuf-server-with-tonic-218e">Setting Up a gRPC Protobuf Server with Tonic</a></li>
<li><a href="https://romankudryashov.com/blog/2021/04/grpc-rust/">Introduction to gRPC in Rust</a></li>
<li><a href="https://truelayer.com/blog/grpc-load-balancing-in-rust">gRPC load balancing in Rust</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc88c51c" class="outline-2">
<h2 id="orgc88c51c"><span class="section-number-2">9</span> Web App</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><a href="https://dev.to/steadylearner/how-to-use-rust-warp-web-framework-2b4e">How to use Warp Framework</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-07-01 Thu 18:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
